============
No arguments
============

f()

---

(expression
  (call
    (NAME)))

===============
Single argument
===============

f(x)

---

(expression
  (call
    (NAME)
    (args
      (variable
        (NAME)))))

==================
Multiple arguments
==================

f(x, y, z)

---

(expression
  (call
    (NAME)
    (args
      (variable
        (NAME))
      (variable
        (NAME))
      (variable
        (NAME)))))


================
Call on quantity
================

f(12.5 MHz)

---

(expression
  (call
    (NAME)
    (args
      (quantity
        (float)
        (units
          (unit_term
            (unit)))))))

=======================
Call on variable dotted
=======================

f(x.y)

---

(expression
  (call
    (NAME)
    (args
      (variable
        (NAME)
        (NAME)))))
