===========
Simple name
===========

variable_name

---

(expression
    (variable
        (NAME)))

===========
Dotted name
===========

variable.attribute_name

---

(expression
    (variable
        (NAME)
        (NAME)))

===================
Invalid dotted name
===================

variable..name

---

    (expression
      (variable
        (NAME)
        (ERROR)
        (NAME)))

============
Missing name
============

variable.name.

---

(expression
  (variable
    (NAME)
    (NAME)
    (MISSING NAME)))

============
Invalid name
============

.name

---

(expression
  (ERROR)
  (variable
    (NAME)))


